# textmining1.py
# 텍스트 마이닝 1
import pandas as pd

moon = open('./assets/speech_moon.txt', encoding='utf-8-sig').read()
# print(moon)

# 한글이 아닌 모든 문자 제거
import re
moon = re.sub('[^가-힣\\s]', ' ', moon)
# print(moon)

# 명사 추출
# konlpy 외부라이브러리 필요
import konlpy
hannanum = konlpy.tag.Hannanum()
nouns = hannanum.nouns(moon)
# print(nouns, flush=True)
# nouns = ['정권교체', '정치교체', '시대교체', '불비불명', '고사', '남쪽', '언덕', '나뭇가지', '년', '동안', '새', '한번', '하늘', '끝', '한번', '천지', '동안', '정치', '거리', '암울한', '시대', '저', '정치', '이상', '남쪽', '나뭇가지', '수', '저', '국민', '오늘', '저', '저', '대', '대통령선거', '출마', '국민', '앞', '선언', '우리나라', '대통령', '존경', '국민', '여러분', '저', '대통령', '우리나라', '대통령', '소수', '특권층', '나라', '보통사람들', '주인', '우리나라', '네', '편', '내', '편', '편가르지', '우리나라', '우리', '라', '말', '진정한', '우리나라', '의', '대통령', '지금', '우리', '보통사람들', '새', '나라', '주인', '행세', '주인', '대접', '말', '몸', '당당', '말', '정치', '참여', '저', '추구', '우리나라', '정치인', '나라', '시민', '정치', '정책과정', '참여', '나라', '저', '시민', '동행', '정치', '저', '추구', '우리나라', '특권', '불평등', '나라', '보통사람들', '기회', '공평', '정의로운', '나라', '권력', '돈', '집단', '나라', '그들', '마음', '시대', '사람들', '희생', '강요', '경제', '정치', '권력', '오늘', '문재인', '우리나라', '우리', '모두', '나라', '선언', '국민', '저', '결심', '이유', '보통사람들', '삶', '우리', '현실', '엄중하기', '때문', '근본적', '혁신', '거대', '전환', '나라', '절박', '때문', '우리', '삶', '우리', '사회', '이상', '경제성장', '과실', '소수', '부유층', '대기업', '창고', '황금', '대부분', '보통사람들', '취업불안', '주거불안', '고용불안', '건강불안', '노후불안', '등', '불안', '이불', '잠자리', '국민', '사람', '사람', '빚', '아이', '일자리', '입시부담', '성적스트레스', '학교폭력', '상처', '영혼들', '하나', '둘', '우리', '곁', '삶', '세상', '분', '들', '약자', '고통', '관심', '정부', '부자', '강자', '기득권', '급급', '정치', '사람들', '희망', '때문', '것', '표정', '사람들', '국민들', '희망', '정치', '절실', '필요', '국민', '뜻', '대통령의', '길', '저', '대선출마', '결심', '국민', '여러분', '출마선언문', '제안', '들', '글', '소중', '의견', '제안', '고단', '삶', '거기', '시민', '한숨', '눈물', '정치', '국민', '걱정거리', '초라한', '정부', '모습', '상식', '사회', '권한', '책', '비례', '사회', '인정', '세상', '개천', '용', '수', '사회', '철학', '나', '약자', '얘', '귀', '사람', '진심어린', '위로', '세상', '세금', '나', '사람', '관대', '힘', '사람', '엄격', '잣대', '적용', '사회', '국민들', '의', '수', '어깨', '대통령', '국민', '정부', '것', '국민', '요구', '미안', '가슴', '평범', '상식적', '요구', '소박한', '요구', '정치', '외면', '것', '국가비전', '공부', '고민', '거창', '국가비전', '국민', '마음속', '겸손', '국민', '마음속', '길', '것', '그것', '대통령의', '길', '국민들', '제', '국민', '뜻', '대통령의', '길', '대한민국', '길', '대한민국', '우리', '거대', '전환', '의', '시', '기존', '과거', '방식', '해결', '수', '근본적', '문제들', '우리', '앞', '지금', '우리', '사회', '지배', '경쟁', '승자독식', '강자지배', '의', '원리', '빈부격차', '확대', '중산층', '서민들', '삶', '기반', '붕괴', '중소기업', '자영업자들', '고통', '지역경제', '낙후', '경제성장', '잠재력', '약화', '악순환', '길', '유럽', '미국', '중국', '인도', '등', '세계', '곳곳', '경제위', '고조', '무분별한', '시장만능주의', '결과', '일부', '기존', '자본주', '모델', '수명', '진단', '과도한', '대외의존형', '경제', '취약', '사회안전망', '대한민국', '위', '무엇', '우리', '개발독재', '모델', '유산', '청산해', '시장만능주의', '대표', '시장독재', '모델', '극복', '개방', '공유', '협동', '공생', '원리', '채택', '인간', '인간답', '수', '민주적', '공정한', '시장경제', '모델', '부', '집안', '평생', '한', '집', '자녀들', '출발선', '불공평', '경쟁', '그것', '교육', '정규직', '중소기업', '지방', '산업', '공정', '경쟁', '노력', '만큼', '정당한', '보상', '세상', '지방대학', '나', '고등학교', '나', '실력', '대접', '수', '누구', '공정', '경쟁', '결과', '승복해', '패자', '따뜻한', '위로', '패자부활', '기회', '경쟁', '소외', '양극화', '살벌한', '세상', '대', '사람', '협력', '성장', '나', '결과', '공유', '지속가능', '삶', '토대', '나라', '저', '나라', '북한', '신뢰', '협력', '토대', '위', '평화', '공동번영', '나라', '저', '나라', '저', '두', '가지', '비전', '상생', '평화', '대한민국', '상생', '평화', '대한민국', '공평', '정의', '바탕', '성장', '과실', '나', '복지', '나', '일자리', '최우선', '나', '아이들', '여성', '노인', '행복', '나', '전', '평화로운', '나라', '것', '공평', '정의', '나라', '근간', '승자독식', '강자지배', '질서', '폐', '대한민국', '상생', '평화', '질서', '수립', '저', '공평', '정의', '원칙', '이명박', '정권', '입', '공정사회', '측근세력들', '국가권력', '사유화', '공공성', '파괴', '토건세력', '재벌집단', '최상위', '계층', '이익', '과도', '공정', '자체', '냉소거리', '신뢰', '상생', '사회', '불가능', '저', '시민들', '균등', '기회', '제공', '공평', '반칙', '특권', '부정부패', '척결', '정', '두', '가지', '가치', '근간', '대한민국', '정의', '원칙', '경제', '분야', '강조', '조세정의', '실현', '소득', '곳', '세금', '원칙', '세금', '불로소득', '정치민주화', '경제민주화', '필요', '재벌', '지배구조', '개선', '공정거래질서', '확립', '대기업', '중소기업', '간', '힘', '불균형', '약자', '억울', '것', '노사', '배', '공동운명체', '노동자들', '부당', '해', '권익', '부당', '침해', '일', '노동자들', '목소리', '적극적', '경영', '반영', '때', '기업', '성', '개선', '소수', '강자', '다수', '위', '군림', '약자', '강자', '공존', '상생', '경제', '질서', '것', '경제민주화', '주요', '내용', '대', '성장전략', '획기적', '국가발전', '선성장', '후분배', '낙수효과', '생각', '사회적', '양극화', '성장잠재력', '저하', '결과', '이', '극복', '성장', '분배', '환경', '평화', '역동적', '선순환', '대', '성장전략', '추진', '첫째', '분배', '재분배', '강화', '중산층', '서민들', '유효수요', '구매력', '확대', '소비', '투자', '촉진', '포용적', '성장', '을', '추진', '이', '최저임금', '생활임금', '개념', '정책', '반영', '복지투자', '확대', '서민경제', '활성화', '것', '재벌', '거대기업', '과도한', '경제력', '집중', '억제', '고용', '대부분', '감당', '중소기업', '성장', '중심', '지원', '사회적', '기업', '협동조합', '육성', '등', '사회적', '경제', '확대', '포용적', '성장', '거시구조적', '개혁', '추진', '둘째', '적', '자본', '투자', '강화', '사람', '중심', '경제성장', '실현', '교육혁신', '학생들', '학부모', '고통', '줄', '입시', '과잉', '학습', '대', '평생학습체제', '자리', '일대', '교육혁신', '문화혁신', '국민', '창조성', '이', '기술혁신', '신산업', '형성', '역동적', '파동', '창조적', '성장', '을', '추진', '셋째', '석유시대', '종말', '대비', '재생', '에너지', '비중', '확대', '녹색', '에너지기술', '것', '축', '전기자동차', '제조', '등', '영역', '신산업', '육성', '생태적', '성장', '을', '추진', '추', '원전', '건설', '중단', '수명', '원전', '가동', '중지', '재생', '에너지', '비중', '확대', '만큼', '원전', '비중', '이', '에너지', '종류', '정도', '산업', '소비생활', '전반', '구조', '저', '차', '산업혁명', '수', '변화', '이', '토건사업', '개발사업', '우위', '정부구조', '재정지출', '구조도', '혁신', '산업', '환경', '농림', '국토', '등', '부처', '지속가능성', '가치', '아래', '재편', '넷째', '인터넷', '를', '전세계', '확산', '소통', '네트워크', '기반', '국경', '경쟁', '집단협업', '개방형', '혁신', '협동생태계', '활용', '협력적', '성장', '을', '추진', '인식', '아래', '한반도평화', '남북협력', '강력', '성장동력', '활용', '남북한', '자원', '기술', '인력', '등', '점', '탁월', '보완관계', '평화', '바탕', '서로', '강점', '동북아시아', '세계', '진출', '복지국가', '를', '담대', '정조대왕', '위', '손해', '아래', '이득', '그것', '국가', '일', '라', '말', '백', '년', '전', '이', '소득재분배', '복지국가', '사상', '위정자', '지구상', '어디', '우리', '복지국가', '담대', '때', '때문', '발걸음', '재촉', '복지', '포퓰리즘', '새누리당', '중상모략', '거부', '부자감세', '사업', '시대착오적', '과오', '청산', '복지국가', '우리', '복지국가', '양극화', '분열', '국가', '절박한', '벌', '나라', '운명', '건곤', '척', '복지', '진정성', '진보세력만', '수', '복지', '낭비', '투자', '사람', '투자', '강력', '성장전략', '복지국가', '국', '경쟁력', '복지', '확대', '보육', '교육', '의료', '요양', '등', '사회서비스', '부문', '일자리', '자영업', '과잉인력', '흡수', '수', '공공임대주택', '주거복지', '것', '월세', '대책', '복지국가', '길', '사람', '투', '일자리', '창출', '자영업', '고통', '경감', '삶', '향상', '등', '조의', '효과', '길', '우리', '보편적', '복지국가', '국민', '것', '년', '뒤', '성과', '것', '일자리', '정부', '로', '일자리', '혁명', '을', '복지', '확대', '저', '강력한', '일자리', '혁명', '을', '젊은이들', '실업자', '정규직', '종사', '근로능력', '고령자들', '일할', '수', '기회', '일자리', '요구', '일자리', '창출', '정규직', '정규직', '전환', '촉진', '정규직', '차별철폐', '근로시간', '축', '신규고용', '확대', '고용영향평가제도', '채택', '고용증진', '기업지원', '연계', '등', '중요', '정책수단', '채택', '정보통신', '산업', '바이오산업', '나노', '산업', '재생에너지', '산업', '문화산업', '콘텐츠산업', '등', '신산업', '일자리', '대대적', '앞', '한', '보육', '교육', '의료', '복지', '등', '사회서비스', '부문', '무궁무진한', '잠재적', '일자리', '보고', '일자리', '곳', '희망', '수', '지방', '일자리', '특별', '노력', '지역균형발전', '산업', '균형', '일자리', '균형', '목표', '이명박', '정부', '방해', '불구', '국민', '세종시', '혁신도시', '지방', '일자리', '창출', '거점', '공기업', '공무원', '지역우대', '채용', '각종', '정부', '지원', '지방채용', '연동제', '확대', '정책', '실효성', '담보', '대통령', '저', '대통령', '직속', '국가일자리위원회', '를', '설치', '일자리점검', '범정부회', '를', '개최', '일자리', '마련', '상황', '점검', '독려', '저', '훗날', '일자리', '혁명', '대통령', '으', '평가', '희망', '아이들', '여성', '노인들', '나라', '아이들', '행복', '나라', '행복', '교육', '학교', '것', '교육혁신', '기본방향', '이', '유아', '초등단계', '과도한', '학습', '부담', '특기적성', '이외', '사교육', '교육', '이념', '전장', '곤란', '교육', '진보', '보수', '아이들', '존재해', '학생', '교사', '학교', '자율성', '창의성', '보장하', '마을', '아이', '수', '지원', '일자리', '산업혁신', '평생학습체제', '뒷받침', '평생학습', '참가율', '선진국', '수준', '리', '우리', '풍요', '어르신들', '희생', '덕분', '노후대비', '겨를', '급격', '가족구조', '변화', '노동시장', '변화', '극심한', '어려움', '사회', '효도', '참여정부', '도입', '기초노령연금', '장기요양보험', '강화', '건강지원', '방법', '차원', '개선', '노인', '일자리', '리', '연륜', '경험', '지역사회', '활용', '수', '방안', '마련', '남녀', '실질적', '평등', '숙제', '가사', '육아', '노인', '책', '여성들', '수준', '여성', '경제활동', '참가율', '세계', '최저', '출산율', '대한민국', '여성들', '말', '가족', '공적서비스', '확대', '여성', '부담', '줄', '취업', '승진기회', '등', '사회적', '차별', '해소', '수', '적극적', '대책', '남녀', '일', '사회', '전진', '대한민국', '한반', '평화', '국가', '존립', '국토방위', '헌법상', '대통령', '막중', '의무', '대외정책', '출발', '튼튼', '국방력', '대한민국', '군', '유능', '군대', '미국과', '관계', '건강', '관계', '발전', '중국', '일본', '러시아', '등', '주변국들', '호혜협력', '관계', '강화', '전쟁', '불안', '한반도', '해방', '이명박', '정부', '파탄', '안보', '새누리당', '정권', '아래', '분쟁', '대결', '휴전선', '일대', '평화경제', '지', '김대중', '대통령의', '공동선언', '노무현', '대통령의', '남북정상선언', '남북', '양측', '책', '이행', '개성공단', '확장', '금강산', '관광', '재개', '금강산', '설악산', '평창', '연결', '국제관광특구', '적극', '남북', '군사대결지대', '공동이익', '창출', '경제지', '전환', '부모들', '안심', '자식', '군대', '안보환경', '특권층', '군대', '안가', '철저', '한편', '젊은이들', '병역', '부담', '사병', '복지', '향상', '북핵문제', '평화적', '해결', '한반', '평화체제', '구축', '저', '북한', '핵', '용인', '수', '확고', '입장', '대화', '협상', '핵', '포기', '실종', '자회담', '재개', '대한민국', '주도적', '역할', '복원', '자회담', '남북관계', '복원', '평화체제', '구축작업', '병행', '추진', '한반도', '평화', '공동번영', '선순환', '구조', '속', '성장동력', '순국선열', '민주영령', '앞', '약속드', '존경', '국민', '여러분', '자리', '애국', '민주', '헌신', '세', '가지', '가치', '숨', '역사', '현장', '저', '역사', '앞', '대통령', '출마선언', '역사', '앞', '저', '자신', '결연', '의지', '역사', '가슴', '미래', '뚜벅뚜벅', '의지', '저것', '수', '벽', '고개', '때', '담쟁', '잎', '담쟁', '잎', '수천', '개', '벽', '도종환', '담쟁', '도종환', '시인', '담쟁', '라', '시', '일부', '우리', '담쟁이', '두', '손', '벽', '특권', '벽', '차별', '벽', '분단', '분열', '벽', '패배주의', '벽', '문재인', '세상', '문', '문재인', '겸손', '권력', '따뜻한', '나라', '국민', '마음', '길', '우리나라', '대통령', '우리', '모두', '주인', '진정한', '우리나라', '대통령']

# 명사의 글자 수 추가
df_word = pd.DataFrame({'word': nouns})
df_word['count'] = df_word['word'].str.len()
# print(df_word)

# 글자 수가 2개 이상인 것 추출
df_word = df_word.query('count>=2')
df_word = df_word.sort_values('count')
# print(df_word)

# 단어별 빈도 구하기
df_word = df_word.groupby('word', as_index=False) \
    .agg(n=('word', 'count')) \
    .sort_values('n', ascending=False)
# print(df_word)

# 상위 20개 추출
top20 = df_word.head(20)

# 막대그래프
import matplotlib.pyplot as plt
import seaborn as sns
plt.rcParams.update({
    'font.family': 'Malgun Gothic',
    'figure.figsize': [6.5, 6]
})
# sns.barplot(x='n', y='word', data=top20)
# plt.show(

# 워드 클라우드
# wordcloud 외부라이브러리 필요

# 데이터 프레임을 딕셔너리로 변경
dic_word = df_word.set_index('word').to_dict()['n']
# print(dic_word)

from wordcloud import WordCloud
# wc = WordCloud(
#     random_state = 1234, # 모양을 랜덤하게 하기 위한 난수 시드값
#     font_path='./assets/DoHyeon-Regular.ttf',
#     width=400,
#     height=400,
#     background_color='white'
# )
# 딕셔너리 데이터가 적용된 워드 클라우드 이미지 생성
# img_wordcloud = wc.generate_from_frequencies(dic_word)
# plt.figure(figsize=(10, 10))
# plt.axis('off') # 테두리선 없애기
# plt.imshow(img_wordcloud)
# plt.show()

# 구름모양 워드클라우드 만들기

# 이미지 로드
from PIL import Image
icon = Image.open("./assets/cloud.png")

# 마스크(mask) 생성
import numpy as np
img = Image.new("RGB", icon.size, (255, 255, 255))
img.paste(icon, icon)
img = np.array(img)

# 워드클라우드 생성
wc = WordCloud(
    random_state = 1234,    # 모양을 랜덤하게 하기 위한 난수
    font_path = './assets/DoHyeon-Regular.ttf',
    width = 400,
    height = 400,
    background_color = "white",
    mask = img,
    colormap="inferno" # 컬러맵 설정
)
img_wordcloud = wc.generate_from_frequencies(dic_word)
plt.figure(figsize=(10, 10)) # 가로,세로 크기
plt.axis("off") # 테두리 선 없애기
plt.imshow(img_wordcloud) # 이미지 보여주기
plt.show()






































